Coding/Cpp/static_dynamic_cast.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+include "../../template.org"
#+title:static_dynamic_cast
* static_cast
static_cast < type-id > ( expression )
该运算符把expression转换为type-id类型，但没有运行时类型检查来保证转换的安全性。它主要有如下几种用法：
- 用于类层次结构中基类（父类）和派生类（子类）之间指针或引用的转换 ::
进行上行转换（把派生类的指针或引用转换成基类表示）是安全的； 　　
进行下行转换（把基类指针或引用转换成派生类表示）时，由于没有动态类型检查，所以是不安全的。
- 用于基本数据类型之间的转换 ::
如把int转换成char，把int转换成enum。这种转换的安全性也要开发人员来保证。
- 把空指针转换成目标类型的空指针 ::
- 把任何类型的表达式转换成void类型 ::
* dynamic_cast
* const_cast
* reinterpret_cast
