Coding/Cpp/static_dynamic_cast.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>static_dynamic_cast</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="static_dynamic_cast"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-27 05:27:25 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#cpp">主页</a><br/><a href="#disqus_thread">评论</a></div>


</head>
<body>


<div id="content">
<h1 class="title">static_dynamic_cast</h1>


<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/bootstrap_old.js"></script>


<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 static_cast</a></li>
<li><a href="#sec-2">2 dynamic_cast</a></li>
<li><a href="#sec-3">3 const_cast</a></li>
<li><a href="#sec-4">4 reinterpret_cast</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> static_cast</h2>
<div class="outline-text-2" id="text-1">

<p>static_cast &lt; type-id &gt; ( expression )<br/>
该运算符把expression转换为type-id类型，但没有运行时类型检查来保证转换的安全性。它主要有如下几种用法：<br/>
</p><dl>
<dt>用于类层次结构中基类（父类）和派生类（子类）之间指针或引用的转换</dt><dd>
</dd>
</dl>

<p>进行上行转换（把派生类的指针或引用转换成基类表示）是安全的； 　　<br/>
进行下行转换（把基类指针或引用转换成派生类表示）时，由于没有动态类型检查，所以是不安全的。<br/>
</p><dl>
<dt>用于基本数据类型之间的转换</dt><dd>
</dd>
</dl>

<p>如把int转换成char，把int转换成enum。这种转换的安全性也要开发人员来保证。<br/>
</p><dl>
<dt>把空指针转换成目标类型的空指针</dt><dd>
</dd>
<dt>把任何类型的表达式转换成void类型</dt><dd>
</dd>
</dl>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> dynamic_cast</h2>
<div class="outline-text-2" id="text-2">

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> const_cast</h2>
<div class="outline-text-2" id="text-3">

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> reinterpret_cast</h2>
<div class="outline-text-2" id="text-4">


<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>
</div>
</div>

</body>
</html>
